src/Reports/ВыпускПродукцииПоВремени/ВыпускПродукцииПоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ВыпускПродукцииПоВремени</name>
  <attributes>
    <name>ДатаНач</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКон</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Report>

src/Catalogs/РабочиеМестаЛинеек/РабочиеМестаЛинеек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РабочиеМестаЛинеек</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Авторизовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкаЗаданийПоВремениПоступления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаРабочихМест</name>
    <type>
      <types>CatalogRef.ГруппыРабочихМест</types>
    </type>
  </attributes>
  <attributes>
    <name>Стенд</name>
    <type>
      <types>CatalogRef.Стенды</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратнаяТара</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучениеЗаданияСканированием</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучениеЗаданияСканированиемВТ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаканчиватьПредыдущийЭтап</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВводIMEI</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВводMACАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВводКодDanfoss</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВводBT</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьБуфер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнитьТехОснастку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ГруппаНоменклатуры</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Комплектация</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехОперации</name>
    <attributes>
      <name>ТехОперация</name>
      <type>
        <types>CatalogRef.ТехОперации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Reports/ВыпускПродукцииПоВремени/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура ПолучитьСписокРМ()
СписокРабочихМест.Очистить();
Запрос = Новый Запрос;
	Для каждого Линейка Из СписокЛинеек Цикл
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РабочиеМестаЛинеек.Ссылка
		|ИЗ
		|	Справочник.РабочиеМестаЛинеек КАК РабочиеМестаЛинеек
		|ГДЕ
		|	РабочиеМестаЛинеек.Линейка = &Линейка
		|	И РабочиеМестаЛинеек.ПометкаУдаления = ЛОЖЬ
		|	И РабочиеМестаЛинеек.ЭтоГруппа = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	РабочиеМестаЛинеек.Код УБЫВ";
	Запрос.УстановитьПараметр("Линейка", Линейка.Значение);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокРабочихМест.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СформироватьДляПЭОНаСервере()
ТабДок.Очистить();

ТаблицаВыпуска = Новый ТаблицаЗначений;

ТаблицаВыпуска.Колонки.Добавить("Продукция",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
ТаблицаВыпуска.Колонки.Добавить("Счёт",Новый ОписаниеТипов("Строка",Новый КвалификаторыСтроки(60)));
ТаблицаВыпуска.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(5,0)));
ТаблицаВыпуска.Колонки.Добавить("КолВне",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(5,0)));
ТаблицаВыпуска.Колонки.Добавить("КолПроизв",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(5,0)));
ТаблицаВыпуска.Колонки.Добавить("КолУсл",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(8,2)));
ТаблицаВыпуска.Колонки.Добавить("КолВнеУсл",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(8,2)));
ТаблицаВыпуска.Колонки.Добавить("КолПроизвУсл",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(8,2)));

//Макет = Отчеты.ВыпускПродукцииПоВремени.ПолучитьМакет("МакетДляПЭО"); 
ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("МакетДляПЭО");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблПродукция = Макет.ПолучитьОбласть("Продукция");
ОблПродукцияВыпущенная = Макет.ПолучитьОбласть("ПродукцияВыпущенная");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.ДатаНач = Отчет.ДатаНач;
ОблШапка.Параметры.ДатаКон = Отчет.ДатаКон;
ТабДок.Вывести(ОблШапка);

Запрос = Новый Запрос;
 
ПолучитьСписокРМ();
Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.ПЗ,
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.ПЗ.ДокументОснование КАК МТК,
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.ПЗ.Изделие КАК Изделие,
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.ДатаНачала
	|ИЗ
	|	РегистрСведений.ЭтапыПроизводственныхЗаданий.СрезПоследних КАК ЭтапыПроизводственныхЗаданийСрезПоследних
	|ГДЕ
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.РабочееМесто В(&СписокРабочихМест)
	|	И ЭтапыПроизводственныхЗаданийСрезПоследних.ДатаНачала МЕЖДУ &ДатаНач И &ДатаКон";
	Если СписокНоменклатуры.Количество() > 0 Тогда
	Запрос.Текст = Запрос.Текст + " И ЭтапыПроизводственныхЗаданийСрезПоследних.Изделие В ИЕРАРХИИ(&СписокНоменклатуры)";
	КонецЕсли;
Запрос.УстановитьПараметр("СписокРабочихМест",СписокРабочихМест);
Запрос.УстановитьПараметр("СписокНоменклатуры",СписокНоменклатуры);
Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Отчет.ДатаНач));
Запрос.УстановитьПараметр("ДатаКон",КонецДня(Отчет.ДатаКон));
Результат = Запрос.Выполнить();
Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
	ТЧ = ТаблицаВыпуска.Добавить();
	ТЧ.Продукция = Выборка.Изделие;
		Если СокрЛП(Выборка.МТК.СтандартныйКомментарий.Наименование) = "Заказанные приборы от клиентов" Тогда
		ТЧ.Счёт = Выборка.МТК.Счёт;		
		КонецЕсли;
			Если (Выборка.ДатаНачала < Отчет.ДатаНач)или(Выборка.ДатаНачала > Отчет.ДатаКон) Тогда
			ТЧ.КолВне = 1;
			ТЧ.КолВнеУсл = Выборка.Изделие.УсловныеПриборы;
			Иначе
			ТЧ.Количество = 1;
			ТЧ.КолУсл = Выборка.Изделие.УсловныеПриборы;
			КонецЕсли; 
	КонецЦикла;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.ПЗ,
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.ПЗ.ДокументОснование КАК МТК,
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.ПЗ.Изделие КАК Изделие,
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.ДатаОкончания
	|ИЗ
	|	РегистрСведений.ЭтапыПроизводственныхЗаданий.СрезПоследних КАК ЭтапыПроизводственныхЗаданийСрезПоследних
	|ГДЕ
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.Линейка В(&СписокЛинеек)
	|	И ЭтапыПроизводственныхЗаданийСрезПоследних.ДатаОкончания = ДАТАВРЕМЯ(1,1,1,0,0,0)";
	Если СписокНоменклатуры.Количество() > 0 Тогда
	Запрос.Текст = Запрос.Текст + " И ЭтапыПроизводственныхЗаданийСрезПоследних.Изделие В ИЕРАРХИИ(&СписокНоменклатуры)";
	КонецЕсли;  	
Запрос.УстановитьПараметр("СписокЛинеек",СписокЛинеек);
Запрос.УстановитьПараметр("СписокНоменклатуры",СписокНоменклатуры);
Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Отчет.ДатаНач));
Запрос.УстановитьПараметр("ДатаКон",КонецДня(Отчет.ДатаКон));
Результат = Запрос.Выполнить();
Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
	ТЧ = ТаблицаВыпуска.Добавить();
	ТЧ.Продукция = Выборка.Изделие;
		Если СокрЛП(Выборка.МТК.СтандартныйКомментарий.Наименование) = "Заказанные приборы от клиентов" Тогда
		ТЧ.Счёт = Выборка.МТК.Счёт;		
		КонецЕсли;
	ТЧ.КолПроизв = 1;
	ТЧ.КолПроизвУсл = Выборка.Изделие.УсловныеПриборы;		
	КонецЦикла;
		Если Свернутый Тогда
		ТаблицаВыпуска.Свернуть("Продукция","Количество,КолВне,КолПроизв,КолУсл,КолВнеУсл,КолПроизвУсл");
		ТаблицаВыпуска.Сортировать("Продукция");
		Иначе
	    ТаблицаВыпуска.Свернуть("Продукция,Счёт","Количество,КолВне,КолПроизв,КолУсл,КолВнеУсл,КолПроизвУсл");
		ТаблицаВыпуска.Сортировать("Продукция,Счёт");
		КонецЕсли; 
			Для каждого ТЧ Из ТаблицаВыпуска Цикл
				Если ТЧ.Количество > 0 Тогда
					Если Не Свернутый Тогда
					ОблПродукцияВыпущенная.Параметры.Счёт = ТЧ.Счёт;
					КонецЕсли; 
				ОблПродукцияВыпущенная.Параметры.Наименование = СокрЛП(ТЧ.Продукция.Наименование);
				ОблПродукцияВыпущенная.Параметры.Продукция = ТЧ.Продукция;
				ОблПродукцияВыпущенная.Параметры.Линейка = ТЧ.Продукция.Линейка;
				ОблПродукцияВыпущенная.Параметры.Кол = ТЧ.Количество;
				ОблПродукцияВыпущенная.Параметры.КолВне = ТЧ.КолВне;
				ОблПродукцияВыпущенная.Параметры.КолПроизв = ТЧ.КолПроизв;
				ОблПродукцияВыпущенная.Параметры.КолУсл = ТЧ.КолУсл;
				ОблПродукцияВыпущенная.Параметры.КолВнеУсл = ТЧ.КолВнеУсл;
				ОблПродукцияВыпущенная.Параметры.КолПроизвУсл = ТЧ.КолПроизвУсл;
				ТабДок.Вывести(ОблПродукцияВыпущенная);
				Иначе
					Если Не Свернутый Тогда
					ОблПродукция.Параметры.Счёт = ТЧ.Счёт;
					КонецЕсли;
				ОблПродукция.Параметры.Наименование = СокрЛП(ТЧ.Продукция.Наименование);
				ОблПродукция.Параметры.Продукция = ТЧ.Продукция;
				ОблПродукция.Параметры.Линейка = ТЧ.Продукция.Линейка;
				ОблПродукция.Параметры.Кол = ТЧ.Количество;
				ОблПродукция.Параметры.КолВне = ТЧ.КолВне;
				ОблПродукция.Параметры.КолПроизв = ТЧ.КолПроизв;
				ОблПродукция.Параметры.КолУсл = ТЧ.КолУсл;
				ОблПродукция.Параметры.КолВнеУсл = ТЧ.КолВнеУсл;
				ОблПродукция.Параметры.КолПроизвУсл = ТЧ.КолПроизвУсл;
				ТабДок.Вывести(ОблПродукция);
				КонецЕсли; 
			КонецЦикла; 
ОблКонец.Параметры.КолИтого = ТаблицаВыпуска.Итог("Количество");
ОблКонец.Параметры.КолВнеИтого = ТаблицаВыпуска.Итог("КолВне");
ОблКонец.Параметры.КолПроизвИтого = ТаблицаВыпуска.Итог("КолПроизв");
ОблКонец.Параметры.КолУслИтого = ТаблицаВыпуска.Итог("КолУсл");
ОблКонец.Параметры.КолВнеУслИтого = ТаблицаВыпуска.Итог("КолВнеУсл");
ОблКонец.Параметры.КолПроизвУслИтого = ТаблицаВыпуска.Итог("КолПроизвУсл");
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 3;
ТабДок.РазмерСтраницы = "A4";
ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
ТабДок.ПолеСверху = 0;
ТабДок.ПолеСлева = 0;
ТабДок.ПолеСнизу = 0;
ТабДок.ПолеСправа = 0;
ТабДок.РазмерКолонтитулаСверху = 0;
ТабДок.РазмерКолонтитулаСнизу = 0;
КонецПроцедуры

&НаСервере
Функция СформироватьНаСервере() 
ТабДок.Очистить();

ТаблицаВыпуска = Новый ТаблицаЗначений;

ТаблицаВыпуска.Колонки.Добавить("Тара",Новый ОписаниеТипов("Строка",Новый КвалификаторыСтроки(4)));
ТаблицаВыпуска.Колонки.Добавить("МТК",Новый ОписаниеТипов("ДокументСсылка.МаршрутнаяКарта"));
ТаблицаВыпуска.Колонки.Добавить("Продукция",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
ТаблицаВыпуска.Колонки.Добавить("Счёт",Новый ОписаниеТипов("Строка",Новый КвалификаторыСтроки(60)));
ТаблицаВыпуска.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(6,0)));
ТаблицаВыпуска.Колонки.Добавить("КолУсл",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(9,2)));

Макет = Отчеты.ВыпускПродукцииПоВремени.ПолучитьМакет("Макет"); 
ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблПродукция = Макет.ПолучитьОбласть("Продукция");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.ДатаНач = Отчет.ДатаНач;
ОблШапка.Параметры.ДатаКон = Отчет.ДатаКон;
ТабДок.Вывести(ОблШапка);

Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПроизводственноеЗадание.ДокументОснование КАК МТК,
	|	ПроизводственноеЗадание.Изделие КАК Изделие,
	|	ПроизводственноеЗадание.ВозвратнаяТара
	|ИЗ
	|	Документ.ПроизводственноеЗадание КАК ПроизводственноеЗадание
	|ГДЕ
	|	ПроизводственноеЗадание.Линейка В ИЕРАРХИИ(&СписокЛинеек)
	|	И ПроизводственноеЗадание.ДокументОснование.Ремонт = ЛОЖЬ
	|	И ПроизводственноеЗадание.ДатаГрупповойУпаковки МЕЖДУ &ДатаНач И &ДатаКон";
	Если СписокНоменклатуры.Количество() > 0 Тогда
	Запрос.Текст = Запрос.Текст + " И ПроизводственноеЗадание.Изделие В ИЕРАРХИИ(&СписокНоменклатуры)";
	Запрос.УстановитьПараметр("СписокНоменклатуры",СписокНоменклатуры);
	КонецЕсли;  	
Запрос.УстановитьПараметр("СписокЛинеек",СписокЛинеек);
Запрос.УстановитьПараметр("ДатаНач",Отчет.ДатаНач);
Запрос.УстановитьПараметр("ДатаКон",Отчет.ДатаКон);
Результат = Запрос.Выполнить();
Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
	ТЧ = ТаблицаВыпуска.Добавить();
	ТЧ.Тара = Выборка.ВозвратнаяТара;
	ТЧ.Продукция = Выборка.Изделие;
		Если СокрЛП(Выборка.МТК.СтандартныйКомментарий.Наименование) = "Заказанные приборы от клиентов" Тогда
		ТЧ.МТК = Выборка.МТК;
		ТЧ.Счёт = Выборка.МТК.Счёт;		
		КонецЕсли; 
	ТЧ.Количество = 1;
	ТЧ.КолУсл = Выборка.Изделие.УсловныеПриборы;		
	КонецЦикла;
ТаблицаВыпускаВТаре = ТаблицаВыпуска.Скопировать();
ТаблицаВыпуска.Свернуть("Продукция,МТК,Счёт","Количество,КолУсл");
ТаблицаВыпуска.Сортировать("Продукция,МТК,Счёт");
	Для каждого ТЧ Из ТаблицаВыпуска Цикл
		Если ЗначениеЗаполнено(ТЧ.МТК) Тогда
		ОблПродукция.Параметры.НомерМТК = ТЧ.МТК.Номер;
		ОблПродукция.Параметры.МТК = ТЧ.МТК;
		ОблПродукция.Параметры.Счёт = ТЧ.Счёт;
		Иначе
		ОблПродукция.Параметры.НомерМТК = "";
		ОблПродукция.Параметры.МТК = "";
		ОблПродукция.Параметры.Счёт = "";		
		КонецЕсли; 
	ОблПродукция.Параметры.Наименование = СокрЛП(ТЧ.Продукция.Наименование);
	ОблПродукция.Параметры.Продукция = ТЧ.Продукция;
	ОблПродукция.Параметры.Линейка = ТЧ.Продукция.Линейка;
	ОблПродукция.Параметры.Кол = ТЧ.Количество;
	ОблПродукция.Параметры.КолУсл = ТЧ.КолУсл;
	ТабДок.Вывести(ОблПродукция);
	КонецЦикла; 
ОблКонец.Параметры.КолИтого = ТаблицаВыпуска.Итог("Количество");
ОблКонец.Параметры.КолУслИтого = ТаблицаВыпуска.Итог("КолУсл");
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 3;
	Если СохранитьВФайл = 1 Тогда
	ТабДокExcel = Новый ТабличныйДокумент;
	ТаблицаВыпуска.Свернуть("Продукция,МТК,Счёт","Количество");
	ТаблицаВыпуска.Сортировать("Продукция,МТК,Счёт");
	Макет = Отчеты.ВыпускПродукцииПоВремени.ПолучитьМакет("МакетExcel"); 
	ОблШапка = Макет.ПолучитьОбласть("Шапка");
	ОблПродукция = Макет.ПолучитьОбласть("Продукция");
	ТабДокExcel.Вывести(ОблШапка);
		Для каждого ТЧ Из ТаблицаВыпуска Цикл
		ОблПродукция.Параметры.Наименование = СокрЛП(ТЧ.Продукция.Наименование);
		ОблПродукция.Параметры.Кол = ТЧ.Количество;
		ОблПродукция.Параметры.Заказ = Лев(ТЧ.МТК.Номер,1)+"-"+Формат(Сред(ТЧ.МТК.Номер,5),"ЧЦ=5");
		ТабДокExcel.Вывести(ОблПродукция);
		КонецЦикла;
	Возврат(ТабДокExcel);
	Иначе
	ОблТара = Макет.ПолучитьОбласть("Тара");
	ОблПродукцияВТаре = Макет.ПолучитьОбласть("ПродукцияВТаре");
	ТаблицаВыпускаВТаре.Свернуть("Тара,Продукция","Количество");
	ТаблицаВыпускаВТаре.Сортировать("Тара,Продукция");
	ТекТара = "-1";
		Для каждого ТЧ Из ТаблицаВыпускаВТаре Цикл
			Если ТекТара <> ТЧ.Тара Тогда
			ОблТара.Параметры.НомерТары = ТЧ.Тара;
			ТабДок.Вывести(ОблТара);
			ТекТара = ТЧ.Тара;		
			КонецЕсли; 
		ОблПродукцияВТаре.Параметры.Наименование = СокрЛП(ТЧ.Продукция.Наименование);
		ОблПродукцияВТаре.Параметры.Кол = ТЧ.Количество;
		ТабДок.Вывести(ОблПродукцияВТаре);
		КонецЦикла;
	ТабДок.РазмерСтраницы = "A4";
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ПолеСверху = 0;
	ТабДок.ПолеСлева = 0;
	ТабДок.ПолеСнизу = 0;
	ТабДок.ПолеСправа = 0;
	ТабДок.РазмерКолонтитулаСверху = 0;
	ТабДок.РазмерКолонтитулаСнизу = 0;	
	Возврат(ТабДок);
	КонецЕсли; 		
КонецФункции

&НаКлиенте
Процедура Сформировать(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		Если ДляПЭО = 1 Тогда
		Состояние("Обработка...",,"Формирование отчёта...");
		СформироватьДляПЭОНаСервере();
		Иначе
			Если СохранитьВФайл Тогда
			Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
			Диалог.Заголовок = "Выберите файл DBF";
			Диалог.ПолноеИмяФайла = ""; 
			Фильтр = "Microsoft Excel (*.xls)|*.xls"; 
			Диалог.Фильтр = Фильтр; 
			Диалог.МножественныйВыбор = Ложь;
				Если Не Диалог.Выбрать() Тогда
			    Возврат;
				КонецЕсли;
			Состояние("Обработка...",,"Сохранение в Microsoft Excel...",БиблиотекаКартинок.ДлительнаяОперация);
			ТабДокExcel = СформироватьНаСервере();
			ТабДокExcel.Записать(Диалог.ПолноеИмяФайла,"XLS");
			Иначе
			Состояние("Обработка...",,"Формирование отчёта...");
			СформироватьНаСервере();
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Отчет.ДатаНач = НачалоДня(ТекущаяДата());
Отчет.ДатаКон = ТекущаяДата();
КонецПроцедуры
